Билет_сервер/src/Documents/ИзменениеУчетнойПолитики/ИзменениеУчетнойПолитики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИзменениеУчетнойПолитики</name>
  <registerRecords>InformationRegister.УчетнаяПолитика</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиНоменклатуры</registerRecords>
  <attributes>
    <name>МетодСписания</name>
    <type>
      <types>EnumRef.МетодыСписания</types>
    </type>
  </attributes>
</mdclass:Document>

Билет_сервер/src/InformationRegisters/УчетнаяПолитика/УчетнаяПолитика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетнаяПолитика</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>МетодСписания</name>
    <type>
      <types>EnumRef.МетодыСписания</types>
    </type>
  </resources>
</mdclass:InformationRegister>

Билет_сервер/src/AccumulationRegisters/ОстаткиНоменклатуры/ОстаткиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиНоменклатуры</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ИзменениеУчетнойПолитики</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Билет_сервер/src/Enums/МетодыСписания/МетодыСписания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МетодыСписания</name>
  <enumValues>
    <name>ПоСредней</name>
  </enumValues>
  <enumValues>
    <name>ФИФО</name>
  </enumValues>
</mdclass:Enum>

Билет_сервер/src/Documents/ИзменениеУчетнойПолитики/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.УчетнаяПолитика.Записывать=Истина;
	Движения.УчетнаяПолитика.Очистить();
	Движение=Движения.УчетнаяПолитика.Добавить();
	Движение.Период=Дата;
	Движение.МетодСписания=МетодСписания;
	
	Движения.ОстаткиНоменклатуры.Записывать=Истина;
	Движения.ОстаткиНоменклатуры.Очистить();
	
	Если МетодСписания=Перечисления.МетодыСписания.ПоСредней Тогда
		
		Движения.ОстаткиНоменклатуры.Записать();
		
		Блокировка=Новый БлокировкаДанных;
		ЭлементБлокировки=Блокировка.Добавить("РегистрНакопления.ОстаткиНоменклатуры");
		Блокировка.Заблокировать();
		
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		             |	ОстаткиНоменклатурыОстатки.Номенклатура,
		             |	ОстаткиНоменклатурыОстатки.Партия,
		             |	ОстаткиНоменклатурыОстатки.КоличествоОстаток КАК Количество,
		             |	ОстаткиНоменклатурыОстатки.СуммаОстаток КАК Сумма
		             |ИЗ
		             |	РегистрНакопления.ОстаткиНоменклатуры.Остатки(&МоментИтогов, ) КАК ОстаткиНоменклатурыОстатки";
					 
		Запрос.УстановитьПараметр("МоментИтогов", МоментВремени());
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Движение=Движения.ОстаткиНоменклатуры.ДобавитьПриход();
			Движение.Период=Дата;
			ЗаполнитьЗначенияСвойств(Движение, Выборка);
			Движение.Количество=-Выборка.Количество;
			Движение.Сумма=-Выборка.Сумма;
			
			Движение=Движения.ОстаткиНоменклатуры.Добавить();
			Движение.Период=Дата;
			ЗаполнитьЗначенияСвойств(Движение, Выборка);
			Движение.Партия=Ссылка;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
